app/views/inventories/show.html.erb

      <tbody>
        <% @inventory.inventory_foods.each do |item| %>
---
SELECT "inventory_foods".* FROM "inventory_foods" WHERE "inventory_foods"."inventory_id" = $1  [["inventory_id", 1]]