app/controllers/foods_controller.rb

SELECT "foods".* FROM "foods"
---
  def index
    @foods = Food.all

INSERT INTO "foods" ("created_at", "updated_at", "name", "measurement_unit", "price", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2023-05-13 05:02:38.309390"], ["updated_at", "2023-05-13 05:02:38.309390"], ["name", "Tomato"], ["measurement_unit", "kg"], ["price", "25.0"], ["user_id", 1]]
---
  def create
    # @user = current_user
    @food = Food.new(food_params)
    @food.user_id = current_user.id
    if @food.save