app/controllers/inventories_controller.rb

  def index
    @inventories = Inventory.all
---
SELECT "inventories".* FROM "inventories"

  def show
    @inventory = Inventory.find_by(id: params[:id])
---
SELECT "inventories".* FROM "inventories" WHERE "inventories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_inventory
    @inventory = if params[:id] == 'new'
                   Inventory.new
                 else
                   Inventory.find(params[:id])
---
SELECT "inventories".* FROM "inventories" WHERE "inventories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]