app/controllers/recipes_controller.rb

  def show
    @recipe = Recipe.find_by_id(params[:id])
    @recipe_foods = @recipe.recipe_foods.includes(:food)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1  [["id", 1]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 18]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" IS NULL LIMIT $1  [["LIMIT", 1]]

  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.user_id = current_user.id
    @recipe.public_recipe = params[:recipe][:public_recipe] == '1'

    if @recipe.save
---
INSERT INTO "recipes" ("title", "description", "user_id", "created_at", "updated_at", "public_recipe", "name", "instructions", "preparation_time", "cooking_time", "public") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def destroy
    @recipe = Recipe.find(params[:id])
    RecipeFood.where(recipe_id: @recipe.id).destroy_all
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
DELETE FROM "recipe_foods" WHERE "recipe_foods"."id" = $1  [["id", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 18]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 18]]