app/models/recipe.rb

  def total_price
    recipe_foods.includes(:food).sum { |recipe_food| recipe_food.food.price * recipe_food.quantity }
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" IN ($1, $2)  [["id", 2], ["id", 5]]